tap "homebrew/autoupdate"

# Shell essentials
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "fzf"
brew "zoxide"

# File tools
brew "bat"
brew "eza"
brew "yazi"

# Git
brew "git"
brew "git-delta"
brew "lazygit"
brew "gh"

# Editors
brew "neovim"
brew "tmux"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "pngpaste"

# System
brew "btop"
brew "fastfetch"
brew "glow"
brew "task"
brew "mole"
brew "genact"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
